# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

# Brews
brew "yabai"
brew "skhd"

brew "neovim"
brew "tmux"

brew "htop"
brew "bat"
brew "exa"
brew "tree"
brew "watch"
brew "chezmoi"
brew "lazygit"
brew "neofetch"
brew "gnupg"
brew "exiftool"
brew "virtualenv"
brew "ripgrep"

brew "go"
brew "lua"
brew "node"
brew "python@3.10"
brew "python@3.11"
brew "r"
brew "lua"

brew "git"
brew "yarn"

brew "graphviz"

brew "jq"
brew "gcc"
brew "cmake"

brew "mas"

# Casks
cask "1password"
cask "1password-cli"
cask "appcleaner"
cask "carbon-copy-cloner"
cask "cryptomator"
cask "devtoys"
cask "espanso"
cask "firefox"
cask "insomnia"
cask "jetbrains-toolbox"
cask "kitty"
cask "little-snitch"
cask "obs"
cask "obsidian"
cask "protonvpn"
cask "protonmail-bridge"
cask "slack"
cask "signal"
cask "stats"
cask "table-plus"
cask "thunderbird"
cask "visual-studio-code"
cask "vlc"

# Fonts
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"

# MAS
mas "Xcode", id: 497799835
