# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

# Brews / Formulae
brew "neovim"
brew "zellij"
brew "yazi"

brew "htop"
brew "bat"
brew "exa"
brew "tree"
brew "watch"
brew "lazygit"
brew "gnupg"
brew "exiftool"
brew "virtualenv"
brew "ripgrep"
brew "uv"
brew "ffmpeg"

brew "go"
brew "lua"
brew "node"
brew "python@3.11"
brew "python@3.12"
brew "python@3.13"

brew "git"
brew "chezmoi"

brew "yarn"
brew "pnpm"
brew "biome"

brew "graphviz"

brew "jq"
brew "gcc"
brew "cmake"

brew "mas"

# Casks
cask "1password"
cask "1password-cli"
cask "arc"
cask "appcleaner"
cask "blender"
cask "carbon-copy-cloner"
cask "cryptomator"
cask "discord"
cask "firefox"
cask "fork"
cask "handbrake"
cask "httpie"
cask "kitty"
cask "little-snitch"
cask "obs"
cask "orbstack"
cask "poedit"
cask "protonvpn"
cask "protonmail-bridge"
cask "raycast"
cask "sketch"
cask "slack"
cask "signal"
cask "stats"
cask "tableplus"
cask "vlc"
cask "yubico-authenticator"
cask "zed"
cask "zoom"

# Fonts
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"

# Mac App Store (MAS)
mas "Xcode", id: 497799835
mas "Things 3", id: 904280696
