# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

tap "1password/tap"
tap "getsentry/tools"
tap "shopify/shopify"
tap "stripe/stripe-cli"
tap "nikitabobko/tap"

# Brews / Formulae
brew "neovim"
brew "tmux"
brew "starship"

brew "htop"
brew "bat"
brew "eza"
brew "fzf"
brew "tree"
brew "watch"
brew "lazygit"
brew "gnupg"
brew "exiftool"
brew "virtualenv"
brew "ripgrep"
brew "ruff"
brew "uv"
brew "ffmpeg"

brew "elixir"
brew "erlang"
brew "go"
brew "lua"
brew "node"
brew "python@3.11"
brew "python@3.12"
brew "python@3.13"

brew "git"
brew "chezmoi"

brew "yarn"
brew "pnpm"
brew "biome"

brew "graphviz"

brew "jq"
brew "gcc"
brew "cmake"

brew "mas"

brew "shopify-cli"
brew "stripe"
brew "sentry-wizard"

# Casks
cask "1password"
cask "1password-cli"
brew "aerospace"
cask "alfred"
cask "arc"
cask "appcleaner"
cask "blender"
cask "carbon-copy-cloner"
cask "chatterino"
cask "cryptomator"
cask "discord"
cask "firefox"
cask "fork"
cask "handbrake"
cask "httpie"
cask "kitty"
cask "little-snitch"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "netnewswire"
cask "obs"
cask "orbstack"
cask "poedit"
cask "protonvpn"
cask "protonmail-bridge"
cask "sketch"
cask "slack"
cask "signal"
cask "stats"
cask "tableplus"
cask "texifier"
cask "transmission"
cask "vlc"
cask "yubico-authenticator"
cask "zed"
cask "zoom"

# Fonts
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-zed-mono-nerd-font"

# Mac App Store (MAS)
mas "Xcode", id: 497799835
mas "Things 3", id: 904280696
